app/helpers/sessions_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", ""], ["LIMIT", 1]]
---
  def current_user
    response.request.env['HTTP_AUTH_TOKEN'] ? User.find_by(auth_token: response.request.env['HTTP_AUTH_TOKEN']) : nil