app/controllers/histories_controller.rb

  def show
    @all_histories = History.all
---
SELECT "histories".* FROM "histories"