app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mr.equal1996@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "auth_token" = $1 WHERE "users"."id" = $2  [["auth_token", "24d9472c7d76a1d9ac480d10fa4b32d9"], ["id", 1]]
---
  def create
    @user = User.find_by(email_params)
    render json: if @user&.authenticate(params[:password])
                   @user.update_columns(auth_token: SecureRandom.hex)

UPDATE "users" SET "auth_token" = $1 WHERE "users"."id" = $2  [["auth_token", nil], ["id", 104]]
---
  def destroy
    @user = current_user
    render json: if @user
                   @user.update_columns(auth_token: nil)