app/controllers/start_controller.rb

  def show
    if params[:id].match(/\d+/)
      @travels = City.find(params[:id]).travel()
    else
      @travels = City.find_by(name: params[:id]).travel()
---
SELECT "travels".* FROM "travels" INNER JOIN "starts" ON "travels"."id" = "starts"."travel_id" WHERE "starts"."city_id" = $1  [["city_id", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Đà Nẵng"], ["LIMIT", 1]]