app/controllers/travel_controller.rb

SELECT  "travels".* FROM "travels" WHERE "travels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @travel = Travel.find(params[:id])