app/controllers/travels_controller.rb

  def show
    if params[:id]
      @travel = Travel.find_by(id: params[:id])
      render json:  if @travel
                      @destinations = Destination.joins(:city).select("cities.name as destination").where(travel_id: params[:id]).map{|i| i.destination}
                      {
                        id: @travel.id,
                        title: @travel.title,
                        date: @travel.date,
                        duration: @travel.duration,
                        rating: @travel.rating,
                        price: @travel.price,
                        # start: @travel.start_name,
                        destinations: @destinations,
                        description: @travel.description,
                        status: 201
                      }
                    else
                      {
                        status: 404
                      }
                    end
    else
      # Travel.joins(:start => :city).select("travels.id as travel_id").first.travel_id
      @destinations_name = Destination.joins(:city
        ).select("travel_id",
                 "cities.name as destination_name").order("travel_id")
      @destinations = {}
      @destinations_name.each do |item|
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."travel_id" = $1  [["travel_id", 1]]