app/controllers/travels_controller.rb

  def show
    @travels = Travel.all
    @result = []
    @travels.each do |travel|
---
SELECT "travels".* FROM "travels"