app/controllers/users_controller.rb

  def create
    @user = User.new(user_create_params)
    render json: if !User.find_by(user_email_params).nil?
                   { message: 'Conflict', status: 409 }
                 elsif @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sihc"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password_digest", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"